nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKGATEOVERRIDE0</name>
          <description>Clock gate override 0</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDIO0</name>
              <description>SDIO0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDIO0_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIO0_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO1</name>
              <description>SDIO1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDIO1_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIO1_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPHY</name>
              <description>USBPHY</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBPHY_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBPHY_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC</name>
              <description>ADC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU</name>
              <description>MU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MU_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MU_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP</name>
              <description>ACMP</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMC</name>
              <description>PMC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMC_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMC_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_SRAM_ACCESS_DISABLE</name>
          <description>AHB SRAM access disable</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM00_IF</name>
              <description>Control AHB access to SRAM partition 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM00_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM00_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM01_IF</name>
              <description>Control AHB access to SRAM partition 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM01_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM01_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM02_IF</name>
              <description>Control AHB access to SRAM partition 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM02_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM02_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM03_IF</name>
              <description>Control AHB access to SRAM partition 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM03_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM03_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM04_IF</name>
              <description>Control AHB access to SRAM partition 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM04_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM04_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM05_IF</name>
              <description>Control AHB access to SRAM partition 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM05_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM05_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM06_IF</name>
              <description>Control AHB access to SRAM partition 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM06_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM06_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM07_IF</name>
              <description>Control AHB access to SRAM partition 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM07_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM07_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM08_IF</name>
              <description>Control AHB access to SRAM partition 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM08_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM08_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM09_IF</name>
              <description>Control AHB access to SRAM partition 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM09_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM09_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM010_IF</name>
              <description>Control AHB access to SRAM partition 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM010_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM010_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM011_IF</name>
              <description>Control AHB access to SRAM partition 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM011_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM011_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM012_IF</name>
              <description>Control AHB access to SRAM partition 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM012_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM012_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM013_IF</name>
              <description>Control AHB access to SRAM partition 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM013_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM013_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM014_IF</name>
              <description>Control AHB access to SRAM partition 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM014_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM014_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM015_IF</name>
              <description>Control AHB access to SRAM partition 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM015_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM015_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM016_IF</name>
              <description>Control AHB access to SRAM partition 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM016_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM016_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM017_IF</name>
              <description>Control AHB access to SRAM partition 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM017_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM017_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM018_IF</name>
              <description>Control AHB access to SRAM partition 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM018_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM018_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM019_IF</name>
              <description>Control AHB access to SRAM partition 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM019_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM019_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM020_IF</name>
              <description>Control AHB access to SRAM partition 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM020_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM020_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM021_IF</name>
              <description>Control AHB access to SRAM partition 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM021_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM021_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM022_IF</name>
              <description>Control AHB access to SRAM partition 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM022_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM022_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM023_IF</name>
              <description>Control AHB access to SRAM partition 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM023_IF_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM023_IF_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM024_IF</name>
              <description>Control AHB access to SRAM partition 24</description>
              <bitOffset>24</bitOffset>
