nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>PDSLEEPCFG1</name>
          <description>Sleep configuration 1</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67FFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PQ_SRAM_PPD</name>
              <description>Periphery power for PowerQuad RAM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PQ_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PQ_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI0_SRAM_APD</name>
              <description>Array power for FLEXSPI0 RAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXSPI0_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI0_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI0_SRAM_PPD</name>
              <description>Periphery power for FLEXSPI0 RAM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXSPI0_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI0_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI1_SRAM_APD</name>
              <description>Array power for FLEXSPI1 RAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXSPI1_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI1_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI1_SRAM_PPD</name>
              <description>Periphery power for FLEXSPI1 RAM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXSPI1_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI1_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_SRAM_APD</name>
              <description>Array power for USB RAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBHS_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBHS_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_SRAM_PPD</name>
              <description>Periphery power for USB RAM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBHS_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBHS_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC0_SRAM_APD</name>
              <description>Array power for uSDHC0 (SD/MMC/SDIO interface) RAM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USDHC0_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USDHC0_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC0_SRAM_PPD</name>
              <description>Periphery power for uSDHC0 (SD/MMC/SDIO interface) RAM</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USDHC0_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USDHC0_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC1_SRAM_APD</name>
              <description>Array power for Casper RAM</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USDHC1_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USDHC1_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC1_SRAM_PPD</name>
              <description>Periphery power for uSDHC1 (SD/MMC/SDIO interface) RAM</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USDHC1_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USDHC1_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASPER_SRAM_PPD</name>
              <description>Periphery power for Casper RAM</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CASPER_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CASPER_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPU_SRAM_APD</name>
              <description>Array Power for GPU SRAM</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPU_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPU_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPU_SRAM_PPD</name>
              <description>Periphery Power for GPU SRAM</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPU_SRAM_PPD0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPU_SRAM_PPD1</name>
                  <description>Powerdown</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMARTDMA_SRAM_APD</name>
              <description>Array Power for SMARTDMA SRAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMARTDMA_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMARTDMA_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMARTDMA_SRAM_PPD</name>
              <description>Periphery Power for SMARTDMA SRAM</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMARTDMA_SRAM_PPD0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMARTDMA_SRAM_PPD1</name>
                  <description>Powerdown</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIPIDSI_SRAM_APD</name>
              <description>Array Power for MIPIDSI SRAM</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIPIDSI_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIPIDSI_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIPIDSI_SRAM_PPD</name>
              <description>Periphery Power for MIPIDSI SRAM</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIPIDSI_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIPIDSI_SRAM_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDIF_SRAM_APD</name>
              <description>Array Power for LCDIF SRAM</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDIF_SRAM_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_SRAM_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDIF_SRAM_PPD</name>
              <description>Periphery Power for LCDIF SRAM</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDIF_SRAM_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_LCDIF_SRAM_PPD1_1</name>
                  <description>Powerdown</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP_PD</name>
              <description>DSP</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSP_PD_0</name>
                  <description>DSP not power gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_PD_1</name>
                  <description>DSP power gated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIPIDSI_PD</name>
              <description>MIPIDSI</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIPIDSI_PD_0</name>
                  <description>MIPI DSI not power gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIPIDSI_PD_1</name>
                  <description>MIPI DSI power gated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_PD</name>
              <description>OTP</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OTP_PD_0</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTP_PD_1</name>
                  <description>Not Powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROM_PD</name>
              <description>ROM</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROM_PD_0</name>
                  <description>ROM Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROM_PD_1</name>
                  <description>ROM not Powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSPAD_SDIO1_REF_PD</name>
              <description>High speed pad SDIO1 sleep mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSPAD_SDIO1_REF_PD_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSPAD_SDIO1_REF_PD_1</name>
                  <description>Powerdown</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_SLEEP</name>
              <description>SRAM sleep mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM_SLEEP_0</name>
                  <description>RAM Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM_SLEEP_1</name>
                  <description>RAM Sleep mode. Needed when vddcore can be &lt; 0.6V to ensure contents retained. Memories not accessible in this mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
