nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>PRSTCTL1</name>
          <description>Peripheral Reset Control Register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB18100FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSGPIO0</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO1</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO2</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO3</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO4</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO5</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO6</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO7</name>
              <description>HSGPIO[7:0] reset control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSGPIO_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSGPIO_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC</name>
              <description>CRC reset control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC0</name>
              <description>DMAC reset control</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC1</name>
              <description>DMAC reset control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU</name>
              <description>MU reset control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MU_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MU_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMA</name>
              <description>SEMA reset control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMA_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMA_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQME</name>
              <description>FREQME reset control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREQME_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQME_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL2</name>
          <description>Peripheral Reset Control Register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC001011F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CT32BIT0</name>
              <description>CT32BIT[4:0] reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT32BIT_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT1</name>
              <description>CT32BIT[4:0] reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT32BIT_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT2</name>
              <description>CT32BIT[4:0] reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT32BIT_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT3</name>
              <description>CT32BIT[4:0] reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT32BIT_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT4</name>
              <description>CT32BIT[4:0] reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT32BIT_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRT0</name>
              <description>MRT0 reset control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MRT0_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MRT0_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT1</name>
              <description>WWDT1 reset control</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WWDT1_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WWDT1_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C0</name>
              <description>I3C0 reset control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I3C_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C1</name>
              <description>I3C1 reset control</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I3C_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOINTCTL</name>
              <description>GPIOINTCTL reset control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIOINTCTL_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOINTCTL_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIMCTL</name>
              <description>INPUTMUX reset control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIMCTL_CLR</name>
                  <description>Clear Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIMCTL_SET</name>
                  <description>Set Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
