nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTL1</name>
      <description>SYSCTL1</description>
      <groupName>SYSCTL1</groupName>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x204</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UPDATELCKOUT</name>
          <description>Update Clock Lockout</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UPDATELCKOUT</name>
              <description>Update Clock Lockout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UPDATELCKOUT_0</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATELCKOUT_1</name>
                  <description>Protected Mode. Cannot be written to. Currently this register does not lock anything</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKPINDIR</name>
          <description>MCLK direction control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MCLKPINDIR</name>
              <description>MCLK direction control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCLKPINDIR_0</name>
                  <description>I2S MCLK is in input direction</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCLKPINDIR_1</name>
                  <description>I2S MCLK is in the output direction</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSPNMISRCSEL</name>
          <description>DSP NMI source selection</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NMISRCSEL</name>
              <description>DSP NMI source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIEN</name>
              <description>NMI Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NMIEN_0</name>
                  <description>Disable NMI Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMIEN_1</name>
                  <description>Enable NMI Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>14</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FCCTRLSEL[%s]</name>
          <description>Flexcomm control selection</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCKINSEL</name>
              <description>SCK IN Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCKINSEL_0</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_1</name>
                  <description>Shared Set0 I2S signals</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_2</name>
                  <description>Shared Set1 I2S signals</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSINSEL</name>
              <description>SCK IN Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCKINSEL_0</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_1</name>
                  <description>Shared Set0 I2S signals</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_2</name>
                  <description>Shared Set1 I2S signals</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAINSEL</name>
              <description>DATA IN Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCKINSEL_0</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_1</name>
                  <description>Shared Set0 I2S signals</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_2</name>
                  <description>Shared Set1 I2S signals</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAOUTSEL</name>
              <description>DATA OUT Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCKINSEL_0</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_1</name>
                  <description>Shared Set0 I2S signals</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKINSEL_2</name>
                  <description>Shared Set1 I2S signals</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHAREDCTRLSET0</name>
          <description>Shared control set</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHAREDSCKSEL</name>
              <description>Shared SCK Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDWSSEL</name>
              <description>Shared WS Select:</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAREDWSSEL_0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDDATASEL</name>
              <description>Shared DATA Select:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAREDWSSEL_0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC0DATAOUTEN</name>
              <description>FLEXCOMM0 DATAOUT Output Enable:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN0_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN0_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC1DATAOUTEN</name>
              <description>FLEXCOMM1 DATAOUT Output Enable:</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN1_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN1_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC2DATAOUTEN</name>
              <description>FLEXCOMM2 DATAOUT Output Enable:</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN2_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN2_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC3DATAOUTEN</name>
              <description>FLEXCOMM3 DATAOUT Output Enable:</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN3_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN3_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC4DATAOUTEN</name>
              <description>FLEXCOMM4 DATAOUT Output Enable:</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN4_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN4_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC5DATAOUTEN</name>
              <description>FLEXCOMM5 DATAOUT Output Enable:</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN5_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN5_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC6DATAOUTEN</name>
              <description>FLEXCOMM6 DATAOUT Output Enable:</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN6_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN6_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC7DATAOUTEN</name>
              <description>FLEXCOMM7 DATAOUT Output Enable:</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN7_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN7_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
