nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>SHAREDCTRLSET1</name>
          <description>Shared control set</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHAREDSCKSEL</name>
              <description>Shared SCK Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDSCKSEL_7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDWSSEL</name>
              <description>Shared WS Select:</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAREDWSSEL_0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDWSSEL_7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDDATASEL</name>
              <description>Shared DATA Select:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAREDWSSEL_0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREDDATASEL_7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC0DATAOUTEN</name>
              <description>FLEXCOMM0 DATAOUT Output Enable:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN0_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN0_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC1DATAOUTEN</name>
              <description>FLEXCOMM1 DATAOUT Output Enable:</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN1_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN1_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC2DATAOUTEN</name>
              <description>FLEXCOMM2 DATAOUT Output Enable:</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN2_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN2_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC3DATAOUTEN</name>
              <description>FLEXCOMM3 DATAOUT Output Enable:</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN3_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN3_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC4DATAOUTEN</name>
              <description>FLEXCOMM4 DATAOUT Output Enable:</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN4_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN4_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC5DATAOUTEN</name>
              <description>FLEXCOMM5 DATAOUT Output Enable:</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN5_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN5_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC6DATAOUTEN</name>
              <description>FLEXCOMM6 DATAOUT Output Enable:</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN6_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN6_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC7DATAOUTEN</name>
              <description>FLEXCOMM7 DATAOUT Output Enable:</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FC0DATAOUTEN7_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FC0DATAOUTEN7_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXEVPULSEGEN</name>
          <description>RX Event Pulse Generator</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXEVPULSEGEN</name>
              <description>RX Event Pulse Generator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXEVPULSEGEN_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEVPULSEGEN_1</name>
                  <description>Pulse RXEV High for one PSCLK cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
