nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>DMAC0_CHMUX_SEL14</name>
          <description>DMAC0 Channel mux select 14</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM12_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL15</name>
          <description>DMAC0 Channel mux select 15</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMA Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0_1</name>
                  <description>FLEXCOM12_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>37</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMAC1_ITRIG_SEL[%s]</name>
          <description>DMAC1 Input Trigger Select</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_ITRIG_SEL</name>
              <description>DMA Input Trigger Selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_INT0</name>
                  <description>GPIO_INT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT1</name>
                  <description>GPIO_INT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT2</name>
                  <description>GPIO_INT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT3</name>
                  <description>GPIO_INT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_0</name>
                  <description>T0_DMAREQ_M0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_M1</name>
                  <description>T0_DMAREQ_M1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_6</name>
                  <description>T1_DMAREQ_M0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_7</name>
                  <description>T1_DMAREQ_M1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_8</name>
                  <description>T2_DMAREQ_M0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_9</name>
                  <description>T2_DMAREQ_M1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_a</name>
                  <description>T3_DMAREQ_M0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_b</name>
                  <description>T3_DMAREQ_M1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_c</name>
                  <description>T4_DMAREQ_M0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_d</name>
                  <description>T4_DMAREQ_M1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_e</name>
                  <description>DMA0_TRIGOUT_A</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0_TRIGOUT_B</name>
                  <description>DMA0_TRIGOUT_B</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0_TRIGOUT_C</name>
                  <description>DMA0_TRIGOUT_C</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0_TRIGOUT_D</name>
                  <description>DMA0_TRIGOUT_D</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_DMAC0</name>
                  <description>SCT_DMAC0_REQ0</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_DMAC1</name>
                  <description>SCT_DMAC1_REQ1</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASHCRYPT_OUT_DMA</name>
                  <description>HASHCRYPT_OUT_DMA</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_DMA</name>
                  <description>ACMP_DMA</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI0_RX_DMA</name>
                  <description>FlexSPI0_RX_DMA</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI0_TX_DMA</name>
                  <description>FlexSPI0_TX_DMA</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DMA</name>
                  <description>ADC_DMA</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI1_RX_DMA</name>
                  <description>FlexSPI1_RX_DMA</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI1_TX_DMA</name>
                  <description>FlexSPI1_TX_DMA</description>
                  <value>0x1A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMAC1_OTRIG_SEL[%s]</name>
          <description>DMAC1 Output Trigger Select</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_OTRIG_SEL</name>
              <description>DMA Output Trigger Selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH0</name>
                  <description>DMAC1_OTRIG_CH0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH1</name>
                  <description>DMAC1_OTRIG_CH1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH2</name>
                  <description>DMAC1_OTRIG_CH2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH3</name>
                  <description>DMAC1_OTRIG_CH3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH4</name>
                  <description>DMAC1_OTRIG_CH4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH5</name>
                  <description>DMAC1_OTRIG_CH5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH6</name>
                  <description>DMAC1_OTRIG_CH6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH7</name>
                  <description>DMAC1_OTRIG_CH7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH8</name>
                  <description>DMAC1_OTRIG_CH8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH9</name>
                  <description>DMAC1_OTRIG_CH9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH10</name>
                  <description>DMAC1_OTRIG_CH10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH11</name>
                  <description>DMAC1_OTRIG_CH11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH12</name>
                  <description>DMAC1_OTRIG_CH12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH13</name>
                  <description>DMAC1_OTRIG_CH13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH14</name>
                  <description>DMAC1_OTRIG_CH14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH15</name>
                  <description>DMAC1_OTRIG_CH15</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH16</name>
                  <description>DMAC1_OTRIG_CH16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH17</name>
                  <description>DMAC1_OTRIG_CH17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH18</name>
                  <description>DMAC1_OTRIG_CH18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH19</name>
                  <description>DMAC1_OTRIG_CH19</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH20</name>
                  <description>DMAC1_OTRIG_CH20</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH21</name>
                  <description>DMAC1_OTRIG_CH21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH22</name>
                  <description>DMAC1_OTRIG_CH22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH23</name>
                  <description>DMAC1_OTRIG_CH23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH24</name>
                  <description>DMAC1_OTRIG_CH24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH25</name>
                  <description>DMAC1_OTRIG_CH25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH26</name>
                  <description>DMAC1_OTRIG_CH26</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH27</name>
                  <description>DMAC1_OTRIG_CH27</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH28</name>
                  <description>DMAC1_OTRIG_CH28</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH29</name>
                  <description>DMAC1_OTRIG_CH29</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH30</name>
                  <description>DMAC1_OTRIG_CH30</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH31</name>
                  <description>DMAC1_OTRIG_CH31</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH32</name>
                  <description>DMAC1_OTRIG_CH32</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH33</name>
                  <description>DMAC1_OTRIG_CH33</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH34</name>
                  <description>DMAC1_OTRIG_CH34</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH35</name>
                  <description>DMAC1_OTRIG_CH35</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH36</name>
                  <description>DMAC1_OTRIG_CH36</description>
                  <value>0x24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL0</name>
          <description>DMAC1 Channel mux select 0</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH0_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM8_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL1</name>
          <description>DMAC1 Channel mux select 1</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH1_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM8_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL2</name>
          <description>DMAC1 Channel mux select 2</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH2_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM9_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL3</name>
          <description>DMAC1 Channel mux select 3</description>
          <addressOffset>0x52C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH3_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM9_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL4</name>
          <description>DMAC1 Channel mux select 4</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH4_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM10_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_CHMUX_SEL5</name>
          <description>DMAC1 Channel mux select 5</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC1_CHMUX_SEL</name>
              <description>DMAC1 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_0</name>
                  <description>DMIC_CH5_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_CHMUX_SEL_1</name>
                  <description>FLEXCOM10_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
