nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>CT32BIT2_CAP2_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CT32BIT2_CAP3_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CT32BIT3_CAP0_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CT32BIT3_CAP1_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
