nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="CACHE64_CTRL0">
      <name>CACHE64_CTRL1</name>
      <description>CACHE64</description>
      <groupName>CACHE64_CTRL</groupName>
      <baseAddress>0x40034000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x810</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>CACHE64_POLSEL0</name>
      <description>CACHE64_POLSEL</description>
      <alternatePeripheral>CACHE64_CTRL0</alternatePeripheral>
      <groupName>CACHE64_POLSEL</groupName>
      <headerStructName>CACHE64_POLSEL</headerStructName>
      <baseAddress>0x40033000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG0_TOP</name>
          <description>Region 0 Top Boundary</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2AAA800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_TOP</name>
              <description>Upper Limit Of Region 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG1_TOP</name>
          <description>Region 1 Top Boundary</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5555400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG1_TOP</name>
              <description>Upper Limit Of Region 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POLSEL</name>
          <description>Policy Select</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_POLICY</name>
              <description>Policy Select For Region 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG0_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_POLICY</name>
              <description>Policy Select For Region 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG1_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_POLICY</name>
              <description>Policy Select For Region 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG2_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="CACHE64_POLSEL0">
      <name>CACHE64_POLSEL1</name>
      <description>CACHE64_POLSEL</description>
      <alternatePeripheral>CACHE64_CTRL1</alternatePeripheral>
      <groupName>CACHE64_POLSEL</groupName>
      <baseAddress>0x40034000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>I3C0</name>
      <description>I3C</description>
      <groupName>I3C</groupName>
      <headerStructName>I3C</headerStructName>
      <baseAddress>0x40036000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I3C0</name>
        <value>49</value>
      </interrupt>
      <registers>
        <register>
          <name>MCONFIG</name>
          <description>Master Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFB</resetMask>
          <fields>
            <field>
              <name>MSTENA</name>
              <description>Master enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASTER_OFF</name>
                  <description>MASTER_OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_ON</name>
                  <description>MASTER_ON</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_CAPABLE</name>
                  <description>MASTER_CAPABLE</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISTO</name>
              <description>Disable Timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HKEEP</name>
              <description>High-Keeper</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>NONE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIRED_IN</name>
                  <description>WIRED_IN</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASSIVE_SDA</name>
                  <description>PASSIVE_SDA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASSIVE_ON_SDA_SCL</name>
                  <description>PASSIVE_ON_SDA_SCL</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODSTOP</name>
              <description>Open drain stop</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPBAUD</name>
              <description>Push-pull baud rate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPLOW</name>
              <description>Push-Pull low</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODBAUD</name>
              <description>Open drain baud rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODHPP</name>
              <description>Open drain high push-pull</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>Skew</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2CBAUD</name>
              <description>I2C baud rate</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCONFIG</name>
          <description>Slave Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFEFF037F</resetMask>
          <fields>
            <field>
              <name>SLVENA</name>
              <description>Slave enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>Not acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCHSS</name>
              <description>Match START or STOP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S0IGNORE</name>
              <description>S0/S1 errors ignore</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDROK</name>
              <description>Double Data Rate OK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDRAND</name>
              <description>ID random</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFLINE</name>
              <description>Offline</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BAMATCH</name>
              <description>Bus available match</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR</name>
              <description>Static address</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSTATUS</name>
          <description>Slave Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFBC7FF7F</resetMask>
          <fields>
            <field>
              <name>STNOTSTOP</name>
              <description>Status not stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STMSG</name>
              <description>Status message</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STCCCH</name>
              <description>Status Common Command Code Handler</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STREQRD</name>
              <description>Status required</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STREQWR</name>
              <description>Status request write</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STDAA</name>
              <description>Status Dynamic Address Assignment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STHDR</name>
              <description>Status High Data Rate</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>START</name>
              <description>Start</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>Matched</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PEND</name>
              <description>Received message pending</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXNOTFULL</name>
              <description>Transmit buffer is not full</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DACHG</name>
              <description>DACHG</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCC</name>
              <description>Common Command Code</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRWARN</name>
              <description>Error warning</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDRMATCH</name>
              <description>High Data Rate command match</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANDLED</name>
              <description>Common-Command-Code handled</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVENT</name>
              <description>Event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVDET</name>
              <description>Event details</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>NONE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>NO_REQUEST</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACKED</name>
                  <description>NACKED</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKED</name>
                  <description>ACKED</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBIDIS</name>
              <description>In-Band Interrupts are disabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRDIS</name>
              <description>Master requests are disabled</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HJDIS</name>
              <description>Hot-Join is disabled</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTSTATE</name>
              <description>Activity state from Common Command Codes (CCC)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LATENCY</name>
                  <description>NO_LATENCY</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY_1MS</name>
                  <description>LATENCY_1MS</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY_100MS</name>
                  <description>LATENCY_100MS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY_10S</name>
                  <description>LATENCY_10S</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMECTRL</name>
              <description>Time control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIME_CONTROL</name>
                  <description>NO_TIME_CONTROL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNC_MODE</name>
                  <description>ASYNC_MODE</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
