nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
              <name>PORT26</name>
              <description>Port pins</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORT_0</name>
                  <description>Read- pin is low; Write- clear output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_1</name>
                  <description>Read- pin is high; Write- set output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT27</name>
              <description>Port pins</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORT_0</name>
                  <description>Read- pin is low; Write- clear output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_1</name>
                  <description>Read- pin is high; Write- set output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT28</name>
              <description>Port pins</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORT_0</name>
                  <description>Read- pin is low; Write- clear output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_1</name>
                  <description>Read- pin is high; Write- set output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT29</name>
              <description>Port pins</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORT_0</name>
                  <description>Read- pin is low; Write- clear output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_1</name>
                  <description>Read- pin is high; Write- set output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT30</name>
              <description>Port pins</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORT_0</name>
                  <description>Read- pin is low; Write- clear output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_1</name>
                  <description>Read- pin is high; Write- set output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT31</name>
              <description>Port pins</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORT_0</name>
                  <description>Read- pin is low; Write- clear output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_1</name>
                  <description>Read- pin is high; Write- set output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MPIN[%s]</name>
          <description>Masked Port Pin</description>
          <addressOffset>0x2180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MPORTP0</name>
              <description>Mask bits for port pins</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP1</name>
              <description>Mask bits for port pins</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP2</name>
              <description>Mask bits for port pins</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP3</name>
              <description>Mask bits for port pins</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP4</name>
              <description>Mask bits for port pins</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP5</name>
              <description>Mask bits for port pins</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP6</name>
              <description>Mask bits for port pins</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP7</name>
              <description>Mask bits for port pins</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP8</name>
              <description>Mask bits for port pins</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP9</name>
              <description>Mask bits for port pins</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP10</name>
              <description>Mask bits for port pins</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP11</name>
              <description>Mask bits for port pins</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP12</name>
              <description>Mask bits for port pins</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP13</name>
              <description>Mask bits for port pins</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP14</name>
              <description>Mask bits for port pins</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP15</name>
              <description>Mask bits for port pins</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP16</name>
              <description>Mask bits for port pins</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP17</name>
              <description>Mask bits for port pins</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPORTP18</name>
              <description>Mask bits for port pins</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPORTP_0</name>
                  <description>Read- pin is LOW and/or the corresponding bit in the MASK register is 1; write- clear output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPORTP_1</name>
                  <description>Read- pin is HIGH and the corresponding bit in the MASK register is 0; write- set output bit if the corresponding bit in the MASK register is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
