nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>FIFOSTAT</name>
          <description>FIFO Status Register</description>
          <addressOffset>0xE04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXERR</name>
              <description>TX FIFO Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TXERR</name>
                  <description>A transmit FIFO error has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXERR</name>
                  <description>A transmit FIFO error has occurred. This error could be an overflow caused by pushing data into a full FIFO, or by an underflow if the FIFO is empty when data is needed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXERR</name>
              <description>RX FIFO Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RXERR</name>
                  <description>A receive FIFO overflow has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXERR</name>
                  <description>A receive FIFO overflow has occurred, caused by software or DMA not emptying the FIFO fast enough</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERINT</name>
              <description>Peripheral Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PERINT</name>
                  <description>The peripheral function has not asserted an interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERINT</name>
                  <description>Indicates that the peripheral function has asserted an interrupt. More information can be found by reading the peripheral's status register (STAT).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmit FIFO Empty</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFIFO_ISNOTEMPTY</name>
                  <description>The transmit FIFO is not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO_ISEMPTY</name>
                  <description>The transmit FIFO is empty, although the peripheral may still be processing the last piece of data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXNOTFULL</name>
              <description>Transmit FIFO is Not Full</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFIFO_ISFULL</name>
                  <description>The transmit FIFO is full and another write would cause it to overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO_ISNOTFULL</name>
                  <description>The transmit FIFO is not full, so more data can be written</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXNOTEMPTY</name>
              <description>Receive FIFO is Not Empty</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXFIFO_ISEMPTY</name>
                  <description>When 0, the receive FIFO is empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFO_ISNOTEMPTY</name>
                  <description>When 1, the receive FIFO is not empty, so data can be read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFULL</name>
              <description>Receive FIFO is Full</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXFIFO_ISNOTFULL</name>
                  <description>The receive FIFO is not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFO_ISFULL</name>
                  <description>The receive FIFO is full. To prevent the peripheral from causing an overflow, data should be read out.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXLVL</name>
              <description>Transmit FIFO Current Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXLVL</name>
              <description>Receive FIFO Current Level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTRIG</name>
          <description>FIFO Trigger Register</description>
          <addressOffset>0xE08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXLVLENA</name>
              <description>Transmit FIFO Level Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Transmit FIFO level does not generate a FIFO level trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An trigger will be generated if the transmit FIFO level reaches the value specified by the FIFOTRIG[TXLVL] field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXLVLENA</name>
              <description>Receive FIFO Level Trigger Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Receive FIFO level does not generate a FIFO level trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An trigger will be generated if the receive FIFO level reaches the value specified by the FIFOTRIG[RXLVL] field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXLVL</name>
              <description>Transmit FIFO Level Trigger Point</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXLVL0</name>
                  <description>Trigger when the TX FIFO becomes empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXLVL1</name>
                  <description>Trigger when the TX FIFO level decreases to 1 entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXLVL15</name>
                  <description>Trigger when the TX FIFO level decreases to 15 entries (is no longer full)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXLVL</name>
              <description>Receive FIFO Level Trigger Point</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXLVL1</name>
                  <description>Trigger when the RX FIFO has received 1 entry (is no longer empty)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXLVL2</name>
                  <description>Trigger when the RX FIFO has received 2 entries</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXLVL15</name>
                  <description>Trigger when the RX FIFO has received 16 entries (has become full)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOINTENSET</name>
          <description>FIFO Interrupt Enable Register</description>
          <addressOffset>0xE10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXERR</name>
              <description>TX Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No interrupt will be generated for a transmit error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt will be generated when a transmit error occurs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXERR</name>
              <description>Receive Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No interrupt will be generated for a receive error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt will be generated when a receive error occurs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXLVL</name>
              <description>Transmit FIFO Level Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No interrupt will be generated based on the TX FIFO level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>If FIFOTRIG[TXLVLENA]=1, then an interrupt will be generated when the TX FIFO level decreases to the level specified by FIFOTRIG[TXLVL]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXLVL</name>
              <description>Receive FIFO Level Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No interrupt will be generated based on the RX FIFO level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>If FIFOTRIG[RXLVLENA]=1, then an interrupt will be generated when the RX FIFO level increases to the level specified by FIFOTRIG[RXLVL]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOINTENCLR</name>
          <description>FIFO Interrupt Enable Clear Register</description>
          <addressOffset>0xE14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXERR</name>
              <description>TX Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_THE_TXERR</name>
                  <description>Clear the TX Error Interrupt Enable bit FIFOINTENSET[TXERR]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXERR</name>
              <description>Receive Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_THE_RXERR</name>
                  <description>Clear the Receive Error Interrupt Enable bit FIFOINTENSET[RXERR]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXLVL</name>
              <description>Transmit FIFO Level Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_THE_TXLVL</name>
                  <description>Clear the Transmit FIFO Level Interrupt Enable bit FIFOINTENSET[TXLVL]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXLVL</name>
              <description>Receive FIFO Level Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_THE_RXLVL</name>
                  <description>Clear the Receive FIFO Level Interrupt Enable bit FIFOINTENSET[RXLVL]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOINTSTAT</name>
          <description>FIFO Interrupt Status Register</description>
          <addressOffset>0xE18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXERR</name>
              <description>TX FIFO Error Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXERR_ISNOTPENDING</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXERR_ISPENDING</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXERR</name>
              <description>RX FIFO Error Interrupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXERR_ISNOTPENDING</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXERR_ISPENDING</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXLVL</name>
              <description>Transmit FIFO Level Interrupt Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXLVL_ISNOTPENDING</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXLVL_ISPENDING</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXLVL</name>
              <description>Receive FIFO Level Interrupt Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXLVL_ISNOTPENDING</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXLVL_ISPENDING</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERINT</name>
              <description>Peripheral Interrupt Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERINT_ISNOTPENDING</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERINT_ISPENDING</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
