nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>STAT</name>
          <description>Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDY0</name>
              <description>Result FIFO 0 Ready Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BELOW_THRESHOLD</name>
                  <description>Not above watermark</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE_THRESHOLD</name>
                  <description>Above watermark</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOF0</name>
              <description>Result FIFO 0 Overflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERFLOW</name>
                  <description>No result FIFO 0 overflow has occurred since the last time that the flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERFLOW_DETECTED</name>
                  <description>At least one result FIFO 0 overflow has occurred since the last time that the flag was cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY1</name>
              <description>Result FIFO1 Ready Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BELOW_THRESHOLD</name>
                  <description>Not above watermark</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE_THRESHOLD</name>
                  <description>Above watermark</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOF1</name>
              <description>Result FIFO1 Overflow Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERFLOW</name>
                  <description>No result FIFO1 overflow has occurred since the last time that the flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERFLOW_DETECTED</name>
                  <description>At least one result FIFO1 overflow has occurred since the last time that the flag was cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEXC_INT</name>
              <description>Interrupt Flag For High-Priority Trigger Exception</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXCEPTION</name>
                  <description>No trigger exceptions have occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXCEPTION_DETECTED</name>
                  <description>A trigger exception has occurred and is pending acknowledgment.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_INT</name>
              <description>Interrupt Flag For Trigger Completion</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLAG_CLEAR</name>
                  <description>Either IE[TCOMP_IE] = 0, or no trigger sequences have run to completion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETION_DETECTED</name>
                  <description>Trigger sequence has been completed and all data is stored in the associated FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_ACTIVE</name>
              <description>ADC Active</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ACTIVE</name>
                  <description>ADC is idle. There are no pending triggers to service and no active commands are being processed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>ADC is processing a conversion, running through the power-up delay, or servicing a trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGACT</name>
              <description>Trigger Active</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_0</name>
                  <description>Command (sequence) associated with Trigger 0 currently being executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_1</name>
                  <description>Command (sequence) associated with Trigger 1 currently being executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_2</name>
                  <description>Command (sequence) associated with Trigger 2 currently being executed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_3</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_4</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_5</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_6</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_7</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_8</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_9</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_10</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_11</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_12</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_13</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_14</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_x_15</name>
                  <description>Command (sequence) from the associated Trigger number currently being executed.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDACT</name>
              <description>Command Active</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMMAND_ACTIVE</name>
                  <description>No command currently in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_1</name>
                  <description>Command 1 currently being executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_2</name>
                  <description>Command 2 currently being executed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_3</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_4</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_5</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_6</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_7</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_8</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_9</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_10</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_11</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_12</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_13</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_14</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_15</name>
                  <description>Associated command number currently being executed.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
