nxp-mcuxpresso/mcux-soc-svd/MIMXRT595S/MIMXRT595S_cm33.xml
        <register>
          <name>TSTAT</name>
          <description>Trigger Status Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>TEXC_NUM</name>
              <description>Trigger Exception Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXCEPTIONS</name>
                  <description>No triggers have been interrupted by a high-priority exception.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT0_MEANS_TRIGGER_0_INTERRUPTED</name>
                  <description>Trigger 0 has been interrupted by a high-priority exception.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT1_MEANS_TRIGGER_1_INTERRUPTED</name>
                  <description>Trigger 1 has been interrupted by a high-priority exception.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_3</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_4</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_5</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_6</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_7</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_8</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_9</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_10</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_11</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_12</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_65529</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xFFF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_65530</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xFFFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_65531</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xFFFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_65532</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xFFFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_65533</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xFFFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_INTERRUPTED_65534</name>
                  <description>Associated trigger sequence has interrupted by a high-priority exception.</description>
                  <value>0xFFFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_BITS_SET_INDICATE_ALL_TRIGGERS_INTERRUPTED</name>
                  <description>Every trigger sequence has been interrupted by a high-priority exception.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_FLAG</name>
              <description>Trigger Completion Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No triggers have been completed. Trigger completion interrupts are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT0_MEANS_TRIGGER_0_COMPLETED</name>
                  <description>Trigger 0 has been completed and trigger 0 has enabled completion interrupts.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT1_MEANS_TRIGGER_1_COMPLETED</name>
                  <description>Trigger 1 has been completed and trigger 1 has enabled completion interrupts.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_3</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_4</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_5</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_6</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_7</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_8</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_9</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_10</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_11</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_12</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_65529</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_65530</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_65531</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_65532</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_65533</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_BITS_INDICATE_TRIGGER_x_COMPLETED_65534</name>
                  <description>Associated trigger sequence has completed and has enabled completion interrupts.</description>
                  <value>0xFFFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_BITS_SET_INDICATE_ALL_TRIGGERS_COMPLETED</name>
                  <description>Every trigger sequence has been completed and every trigger has enabled completion interrupts.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
